%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%                              Übungen SW10                                    %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%Aufgabe 10.1
fprintf('\nAufgabe 10.1 \n');
fprintf('LGS lösen \n \n');

%a)
A=[24 68 0 -36; 0 34 82 -79; 5 76 -33 0; -2 0 -63 65];
b=[16;-2;58;69];
rang = rank(A)
rang = rank([A b])
result=A\b

%b)
A = [0 -6 18 12; -5 -15 15 6; -15 -38 24 4];
b = [24; 11; 9];
fprintf('\nb) - Keine Lösung \n');
rang = rank(A)
rang = rank([A b])
%System hat keine Lösung

%c)
fprintf('\nc)  \n');
A = [2 -6 8 4; 1 3 -1 1; -6 36 -37 -15; 2 -18 16 7; -2 12 -16 0];
b = [10; 0; -43; 18; -18];
rang = rank(A)
rang = rank([A b])
result = A\b



%f)
A = [1.1 -2 9.3 0; -3.3 4.8 -27.3 -0.5; 4.4 -4.4 38.6 -0.8; 2.2 -1.6 23.8 -3.6];
b = [26.2; -75.7; 108; 54.2];
fprintf('\nf) - Keine Lösung \n');
rang = rank(A)